### Exploring the NYC Airbnb Market

In [1]:
import pandas as pd

##### Step 1: Ingesting data

In [2]:
# Load the datasets
df_price = pd.read_csv('data/airbnb_price.csv')
df_room_type = pd.read_excel('data/airbnb_room_type.xlsx')
df_last_review = pd.read_csv('data/airbnb_last_review.tsv', sep='\t')

##### Step 2: Combining data

In [3]:
# Merge the dataframes
df_combined = pd.merge(df_price, df_room_type, on='listing_id', how='inner')
df_combined = pd.merge(df_combined, df_last_review, on='listing_id', how='inner')
df_combined.head()

,listing_id,price,nbhood_full,description,room_type,host_name,last_review
0,2595,225 dollars,"Manhattan, Midtown",Skylit Midtown Castle,Entire home/apt,Jennifer,May 21 2019
1,3831,89 dollars,"Brooklyn, Clinton Hill",Cozy Entire Floor of Brownstone,Entire home/apt,LisaRoxanne,July 05 2019
2,5099,200 dollars,"Manhattan, Murray Hill",Large Cozy 1 BR Apartment In Midtown East,Entire home/apt,Chris,June 22 2019
3,5178,79 dollars,"Manhattan, Hell's Kitchen",Large Furnished Room Near B'way,private room,Shunichi,June 24 2019
4,5238,150 dollars,"Manhattan, Chinatown",Cute & Cozy Lower East Side 1 bdrm,Entire home/apt,Ben,June 09 2019

##### Step 3: Cleaning data

In [4]:
# Convert 'price' to numeric and format as float
df_combined['price']= df_combined['price'].str.replace('dollars', '').astype(float)
df_combined.head()

,listing_id,price,nbhood_full,description,room_type,host_name,last_review
0,2595,225.0,"Manhattan, Midtown",Skylit Midtown Castle,Entire home/apt,Jennifer,May 21 2019
1,3831,89.0,"Brooklyn, Clinton Hill",Cozy Entire Floor of Brownstone,Entire home/apt,LisaRoxanne,July 05 2019
2,5099,200.0,"Manhattan, Murray Hill",Large Cozy 1 BR Apartment In Midtown East,Entire home/apt,Chris,June 22 2019
3,5178,79.0,"Manhattan, Hell's Kitchen",Large Furnished Room Near B'way,private room,Shunichi,June 24 2019
4,5238,150.0,"Manhattan, Chinatown",Cute & Cozy Lower East Side 1 bdrm,Entire home/apt,Ben,June 09 2019

In [5]:
# Print the info of the combined dataframe to check data types and also identify missing values
df_combined.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25209 entries, 0 to 25208
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   listing_id   25209 non-null  int64
 1   price        25209 non-null  float64
 2   nbhood_full  25209 non-null  object
 3   description  25199 non-null  object
 4   room_type    25209 non-null  object
 5   host_name    25201 non-null  object
 6   last_review  25209 non-null  object
dtypes: float64(1), int64(1), object(5)
memory usage: 1.3+ MB

In [6]:
# There's missing values in the description column, identify rows
df_combined[df_combined['description'].isna()]

,listing_id,price,nbhood_full,description,room_type,host_name,last_review
4688,7851219,60.0,"Brooklyn, Williamsburg",NaN,PRIVATE ROOM,John,June 18 2019
4690,7854307,60.0,"Brooklyn, Williamsburg",NaN,private room,John,June 15 2019
4696,7858673,60.0,"Brooklyn, Williamsburg",NaN,Private room,John,June 08 2019
4707,7873655,60.0,"Brooklyn, Williamsburg",NaN,PRIVATE ROOM,John,June 21 2019
4709,7886635,60.0,"Brooklyn, Williamsburg",NaN,Private room,John,June 18 2019
4717,7901635,60.0,"Brooklyn, Williamsburg",NaN,Private room,John,June 23 2019
4829,8192443,60.0,"Brooklyn, Williamsburg",NaN,private room,John,June 23 2019
4901,8341556,55.0,"Manhattan, Harlem",NaN,Private room,Gordon M,May 26 2019
5496,9698992,62.0,"Manhattan, Harlem",NaN,private room,Gordon M,June 14 2019
11986,21733545,175.0,"Manhattan, Hell's Kitchen",NaN,Private room,Sybilla Michelle,June 30 2019

In [10]:
# Fill the missing values in the description column with a text
df_combined['description'] = df_combined['description'].fillna('Cozy Secure Private Room  in A Shared Loft')

In [11]:
# Fill the missing values in the 'host_name' column also with a placeholder text
df_combined['host_name'] = df_combined['host_name'].fillna('Unknown Host')

In [14]:
df_combined.head()

,listing_id,price,nbhood_full,description,room_type,host_name,last_review
0,2595,225.0,"Manhattan, Midtown",Skylit Midtown Castle,Entire home/apt,Jennifer,May 21 2019
1,3831,89.0,"Brooklyn, Clinton Hill",Cozy Entire Floor of Brownstone,Entire home/apt,LisaRoxanne,July 05 2019
2,5099,200.0,"Manhattan, Murray Hill",Large Cozy 1 BR Apartment In Midtown East,Entire home/apt,Chris,June 22 2019
3,5178,79.0,"Manhattan, Hell's Kitchen",Large Furnished Room Near B'way,private room,Shunichi,June 24 2019
4,5238,150.0,"Manhattan, Chinatown",Cute & Cozy Lower East Side 1 bdrm,Entire home/apt,Ben,June 09 2019

In [15]:
df_combined['room_type'].unique()

array(['Entire home/apt', 'private room', 'Private room',
       'entire home/apt', 'PRIVATE ROOM', 'shared room',
       'ENTIRE HOME/APT', 'Shared room', 'SHARED ROOM'], dtype=object)

In [18]:
df_combined['room_type'] = df_combined['room_type'].str.lower().str.replace(' ', '_')

In [21]:
df_combined['host_name'] = df_combined['host_name'].str.title()

In [22]:
# Change data types of 'last_review' to datetime
df_combined['last_review'] = pd.to_datetime(df_combined['last_review'], errors='coerce')

##### Step 4: Write the cleaned data into a new csv file

In [24]:
df_combined.to_csv('data/airbnb_cleaned.csv', index=False)

##### Step 5: Extract useful information (Exploratory Data Analysis)

##### 1. The earliest and latest reviews dates

In [52]:
earliest_review_date = df_combined['last_review'].min().date()
print(f"The earliest review date is: {earliest_review_date}")

latest_review_date = df_combined['last_review'].max().date()
print(f"The latest review date is: {latest_review_date}")

The earliest review date is: 2019-01-01
The latest review date is: 2019-07-09

##### 2.Determining the count of private rooms

In [61]:
private_room_count = df_combined[df_combined['room_type'] == 'private_room'].shape[0]
private_room_count

11356

##### 3. Determining the average listing price

In [68]:
avg_listing_price = df_combined['price'].mean()
print(avg_listing_price)

141.7779364512674

##### 4. Creating a new DataFrame with combined data

In [67]:
new_df = pd.DataFrame(
    {
        'earliest_review_date': [earliest_review_date],
        'latest_review_date': [latest_review_date],
        'private_room_count': [private_room_count],
        'avg_listing_price': [avg_listing_price]
    }

)
new_df

,earliest_review_date,latest_review_date,private_room_count,avg_listing_price
0,2019-01-01,2019-07-09,11356,141.777936